// Задача 10
/*
Console.WriteLine("Введите трехзначное число");
int i = Convert.ToInt32(Console.ReadLine());

if (i>=100 && i<=999)
{

int y = i%100;
int u = y/10;
Console.WriteLine(u);

} else 
{
    Console.WriteLine("Число не трехзначное");
}
*/


